title: AWS EC2 GetPasswordData API Call
id: 1a2b3c4d-5e6f-7a8b-9c0d-1e2f3a4b5c6d
status: test
description: Detects usage of the GetPasswordData API call, which retrieves the encrypted administrator password for a Windows EC2 instance.
references:
  - https://stratus-red-team.cloud/attack-techniques/AWS/aws.credential-access.ec2-get-password-data/
  - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_GetPasswordData.html
  - https://traildiscover.cloud/#EC2-GetPasswordData
author: adanalvarez
date: 2025-04-12
modified: 2025-04-12
tags:
  - attack.credential_access
  - attack.t1552
logsource:
  product: aws
  service: ec2
detection:
  selection:
    eventSource: ec2.amazonaws.com
    eventName: GetPasswordData
  condition: selection
falsepositives:
  - Legitimate administrative actions retrieving Windows EC2 instance passwords
level: medium
