title: AWS SecretsManager GetSecretValue
id: 4a60ff0-36fb-42b7-9b58-a5b53019fb74
status: test
description: Detects GetSecretValue in AWS Secrets Manager
references:
    - https://traildiscover.cloud/#GetSecretValue
author: adanalvarez
date: 2025-03-30
modified: 2025-03-30
tags:
    - attack.credential_access
    - attack.t1552
logsource:
    product: aws
    service: secretsmanager
detection:
    selection_source:
        eventSource: secretsmanager.amazonaws.com
        eventName:
            - GetSecretValue
    condition: selection_source
falsepositives:
    - Valid GetSecretValue
level: low